DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
bool httpServerStarted = false;
bool rawOtaServerStarted = false;
bool setupMode = false;
bool waitStatusRendered = false;
String lastConnectedSetupIp;
bool otaUploadSucceeded = false;
bool otaUploadInProgress = false;
bool otaUploadNeedsReboot = false;
String otaUploadError;
bool assetUploadSucceeded = false;
bool assetUploadInProgress = false;
String assetUploadError;
String assetUploadPath;
size_t assetUploadBytesSeen = 0;
File assetUploadFile;
String activeThemeSpecPath;
String activeThemeSpecHash;
standby::State standbyState;
// Captured when standby takes the screen, so the way back is the theme that was
// really drawn. There is no second resident ThemeSpec slot: both directions
// reload from LittleFS, which #277 measured at 250-420 ms.
String standbyLiveThemePath;
screensaver_preview::State screensaverPreviewState;
// Same contract as standbyLiveThemePath: rendering any stored spec reassigns
// activeThemeSpecPath (commitStoredThemeSpec), so the preview captures the
// really-drawn live theme before it takes the screen.
String screensaverPreviewLivePath;
codexbar_display::esp8266::wifi_setup::State setupWifiState;
WifiCredentials savedWifiCredentials;
bool savedWifiCredentialsAvailable = false;
codexbar_display::esp8266::wifi_recovery::State wifiSetupRecoveryState;
bool rebootPending = false;
void applyWifiInteropPhyMode();
void scheduleReboot(const char* reason);
unsigned long rebootAtMs = 0;
unsigned long lastFrameAcceptedAtMs = 0;
bool pendingHttpRender = false;
codexbar_display::core::SerialConsumeEvent pendingHttpRenderEvent;
bool frameStaleStatusRendered = false;
bool captiveDnsStarted = false;
unsigned long wifiDisconnectedAtMs = 0;
unsigned long wifiReconnectAttemptAtMs = 0;
bool wifiReconnectStatusRendered = false;
FirmwareUpdateState firmwareUpdate;
bool firmwareUpdateNoticeDirty = false;
RuntimeRenderDiagnostics renderDiagnostics;
DeviceSettings deviceSettings;
bool deviceSettingsRecordAvailable = false;
device_settings::ConnectionTransition connectionTransition;
bool connectionTransitionPending = false;
unsigned long connectionTransitionStartedAtMs = 0;
String deviceAuthToken;
String deviceID;
String bootID;
String bootResetReasonJSON;
uint32_t bootResetCounter = 0;

void addCorsHeaders();
void resetWifiReconnectState();
void startHttpServer();

#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
constexpr const char* kLegacyMiniThemeSpecPath = "/themes/u/mini-cl-1-410a37.json";
#endif

void recordRenderFull(const char* kind, unsigned long durationUs) {
  (void)durationUs;
  renderDiagnostics.fullCount++;
  renderDiagnostics.lastKind = kind;
}

void recordRenderPartial(const char* kind, unsigned long durationUs) {
  (void)durationUs;
  renderDiagnostics.partialCount++;
  renderDiagnostics.lastKind = kind;
}

String jsonEscape(const String& raw) {
  String escaped;
  escaped.reserve(raw.length() + 8);
  for (size_t i = 0; i < raw.length(); ++i) {
    const char c = raw.charAt(i);
    switch (c) {
      case '\\':
        escaped += "\\\\";
        break;
      case '"':
        escaped += "\\\"";
        break;
      case '\n':
        escaped += "\\n";
        break;
      case '\r':
        escaped += "\\r";
        break;
      case '\t':
        escaped += "\\t";
        break;
      default:
        escaped += c;
        break;
    }
  }
  return escaped;
}

uint32_t fnv1a32(const String& raw) {
  uint32_t hash = 2166136261UL;
  for (size_t i = 0; i < raw.length(); ++i) {
    hash ^= static_cast<uint8_t>(raw[i]);
    hash *= 16777619UL;
  }
  return hash;
}

String hashHex8(const String& raw) {
  String out = String(fnv1a32(raw), HEX);
  while (out.length() < 8) {
    out = "0" + out;
  }
  return out;
}

void appendJSONNullableString(String& out, const String& value) {
  if (value.length() == 0) {
    out += "null";
    return;
  }
  out += "\"";
  out += jsonEscape(value);
  out += "\"";
}

uint8_t clampBrightnessPercent(int value) {
  return codexbar_display::esp8266::device_settings::ClampBrightnessPercent(value);
}

// Single place that decides how bright the panel is, so entering standby,
// waking up and editing either brightness value all go through one path.
void applyDeviceSettings() {
  if (renderer.SupportsBrightnessControl()) {
    renderer.ApplyBrightnessPercent(standbyState.active
                                        ? deviceSettings.standby.brightnessPercent
                                        : deviceSettings.brightnessPercent);
  }
}

bool loadDeviceSettings() {
  deviceSettings = DeviceSettings{};
  if (!LittleFS.begin() || !LittleFS.exists(kDeviceSettingsPath)) {
    applyDeviceSettings();
    return false;
  }
  File file = LittleFS.open(kDeviceSettingsPath, "r");
  if (!file) {
    applyDeviceSettings();
    return false;
  }
  uint8_t record[kDeviceSettingsRecordBytes] = {};
  const int readBytes = file.read(record, sizeof(record));
  file.close();
  const int brightness = readBytes >= 1 ? record[0] : -1;
  deviceSettings.brightnessPercent =
      codexbar_display::esp8266::device_settings::BrightnessFromPersistedByte(brightness);
  // Records written before the device clock existed only hold the brightness
  // byte; the clock then simply relearns the offset from the next frame.
  int offsetMinutes = 0;
  if (readBytes >= 1 &&
      deviceclock::DecodeUtcOffset(record + 1, static_cast<size_t>(readBytes) - 1, offsetMinutes)) {
    deviceclock::RestoreUtcOffset(runtimeCtx.clock, offsetMinutes);
  }
  // Records written before standby existed stop here, which leaves the standby
  // factory defaults in place.
  if (readBytes > static_cast<int>(kStandbyRecordOffset)) {
    standby::Decode(record + kStandbyRecordOffset,
                    static_cast<size_t>(readBytes) - kStandbyRecordOffset,
                    deviceSettings.standby);
  }
  if (readBytes > static_cast<int>(kClockTransitionRecordOffset)) {
    int64_t transitionEpoch = 0;
    int transitionOffsetMinutes = 0;
    int64_t followingTransitionEpoch = 0;
    int followingTransitionOffsetMinutes = 0;
    if (deviceclock::DecodeUtcOffsetTransition(
            record + kClockTransitionRecordOffset,
            static_cast<size_t>(readBytes) - kClockTransitionRecordOffset,
            transitionEpoch,
            transitionOffsetMinutes,
            &followingTransitionEpoch,
            &followingTransitionOffsetMinutes)) {
      deviceclock::RestoreUtcOffsetTransition(
          runtimeCtx.clock,
          transitionEpoch,
          transitionOffsetMinutes,
          followingTransitionEpoch,
          followingTransitionOffsetMinutes);
    }
  }
  if (readBytes > static_cast<int>(kConnectionModeRecordOffset)) {
    deviceSettings.connectionMode =
        codexbar_display::esp8266::device_settings::DecodeConnectionMode(
            record[kConnectionModeRecordOffset]);
  }
  applyDeviceSettings();
  return readBytes > 0;
}

bool saveDeviceSettings() {
  if (!LittleFS.begin()) {
    return false;
  }
  File file = LittleFS.open(kDeviceSettingsTemporaryPath, "w");
  if (!file) {
    return false;
  }
  uint8_t record[kDeviceSettingsRecordBytes] = {};
  record[0] = deviceSettings.brightnessPercent;
  deviceclock::EncodeUtcOffset(runtimeCtx.clock, record + 1);
  standby::Encode(deviceSettings.standby, record + kStandbyRecordOffset);
  deviceclock::EncodeUtcOffsetTransition(
      runtimeCtx.clock, record + kClockTransitionRecordOffset);
  record[kConnectionModeRecordOffset] =
      static_cast<uint8_t>(deviceSettings.connectionMode);
  const size_t written = file.write(record, sizeof(record));
  file.close();
  if (written != sizeof(record)) {
    LittleFS.remove(kDeviceSettingsTemporaryPath);
    return false;
  }
  if (!LittleFS.rename(kDeviceSettingsTemporaryPath, kDeviceSettingsPath)) {
    LittleFS.remove(kDeviceSettingsTemporaryPath);
    return false;
  }
  return true;
}

bool clearConnectionTransition() {
  if (!LittleFS.begin()) {
    return false;
  }
  if (LittleFS.exists(kConnectionTransitionTemporaryPath)) {
    LittleFS.remove(kConnectionTransitionTemporaryPath);
  }
  if (LittleFS.exists(kConnectionTransitionPath) &&
      !LittleFS.remove(kConnectionTransitionPath)) {
    return false;
  }
  connectionTransition = {};
  connectionTransitionPending = false;
  connectionTransitionStartedAtMs = 0;
  return true;
}

bool saveConnectionTransition(const device_settings::ConnectionTransition& transition) {
  if (!LittleFS.begin()) {
    return false;
  }
  File file = LittleFS.open(kConnectionTransitionTemporaryPath, "w");
  if (!file) {
    return false;
  }
  uint8_t record[device_settings::kConnectionTransitionRecordBytes] = {};
  device_settings::EncodeConnectionTransition(transition, record);
  const size_t written = file.write(record, sizeof(record));
  file.close();
  if (written != sizeof(record)) {
    LittleFS.remove(kConnectionTransitionTemporaryPath);
    return false;
  }
  if (!LittleFS.rename(kConnectionTransitionTemporaryPath, kConnectionTransitionPath)) {
    LittleFS.remove(kConnectionTransitionTemporaryPath);
    return false;
  }
  return true;
}

bool loadConnectionTransition() {
  connectionTransition = {};
  connectionTransitionPending = false;
  connectionTransitionStartedAtMs = 0;
  if (!LittleFS.begin() || !LittleFS.exists(kConnectionTransitionPath)) {
    return false;
  }
  File file = LittleFS.open(kConnectionTransitionPath, "r");
  if (!file) {
    return false;
  }
  uint8_t record[device_settings::kConnectionTransitionRecordBytes] = {};
  const int readBytes = file.read(record, sizeof(record));
  file.close();
  if (!device_settings::DecodeConnectionTransition(
          record, static_cast<size_t>(readBytes), connectionTransition) ||
      deviceSettings.connectionMode != connectionTransition.target) {
    Serial.println("connection_mode_transition_discarded reason=invalid_or_incomplete");
    (void)clearConnectionTransition();
    return false;
  }
  connectionTransitionPending = true;
  connectionTransitionStartedAtMs = millis();
  Serial.printf(
      "connection_mode_transition_loaded from=%s to=%s confirmation_ms=%lu\n",
      device_settings::ConnectionModeName(connectionTransition.previous),
      device_settings::ConnectionModeName(connectionTransition.target),
      device_settings::kConnectionTransitionConfirmationMs);
  return true;
}

device_settings::ConnectionMode requestedConnectionMode(const String& name) {
  if (name == "cable") {
    return device_settings::ConnectionMode::kCable;
  }
  if (name == "wifi") {
    return device_settings::ConnectionMode::kWifi;
  }
  return device_settings::ConnectionMode::kUnspecified;
}

bool beginConnectionTransition(
    device_settings::ConnectionMode target,
    String& error) {
  const device_settings::ConnectionMode previous = deviceSettings.connectionMode;
  if (connectionTransitionPending) {
    error = "connection mode transition already pending";
    return false;
  }
  if (!device_settings::CanBeginConnectionTransition(previous, target)) {
    error = previous == device_settings::ConnectionMode::kLegacyWifiOnly
                ? "Cable is not supported on this migrated device"
                : "invalid connection mode transition";
    return false;
  }

  const device_settings::ConnectionTransition transition{previous, target};
  if (!saveConnectionTransition(transition)) {
    error = "failed to persist connection mode transition";
    return false;
  }
  deviceSettings.connectionMode = target;
  if (!saveDeviceSettings()) {
    deviceSettings.connectionMode = previous;
    (void)clearConnectionTransition();
    error = "failed to persist connection mode";
    return false;
  }
  connectionTransition = transition;
  connectionTransitionPending = true;
  connectionTransitionStartedAtMs = millis();
  Serial.printf(
      "connection_mode_transition_started from=%s to=%s\n",
      device_settings::ConnectionModeName(previous),
      device_settings::ConnectionModeName(target));
  return true;
}

bool confirmConnectionTransition(const String& expectedDeviceID, String& status) {
  if (expectedDeviceID != deviceID) {
    status = "deviceId does not match";
    return false;
  }
  if (!connectionTransitionPending) {
    status = "stable";
    return true;
  }
  if (!clearConnectionTransition()) {
    status = "failed to persist connection mode confirmation";
    return false;
  }
  status = "confirmed";
  Serial.printf(
      "connection_mode_transition_confirmed mode=%s\n",
      device_settings::ConnectionModeName(deviceSettings.connectionMode));
  return true;
}

bool rollbackConnectionTransition(const char* reason) {
  if (!connectionTransitionPending) {
    return true;
  }
  const device_settings::ConnectionMode failedTarget = connectionTransition.target;
  deviceSettings.connectionMode = connectionTransition.previous;
  if (!saveDeviceSettings()) {
    deviceSettings.connectionMode = failedTarget;
    connectionTransitionStartedAtMs = millis();
    Serial.printf("connection_mode_rollback_failed reason=%s\n", reason);
    return false;
  }
  (void)clearConnectionTransition();
  Serial.printf(
      "connection_mode_rolled_back failed=%s restored=%s reason=%s\n",
      device_settings::ConnectionModeName(failedTarget),
      device_settings::ConnectionModeName(deviceSettings.connectionMode),
      reason);
  scheduleReboot("connection_mode_rollback");
  return true;
}

void maintainConnectionTransition() {
  if (!connectionTransitionPending || rebootPending) {
    return;
  }
  if ((millis() - connectionTransitionStartedAtMs) >=
      device_settings::ConnectionTransitionTimeoutMs(setupMode)) {
    (void)rollbackConnectionTransition("confirmation_timeout");
  }
}

bool resolveInitialConnectionMode(bool hasLegacyState) {
  using codexbar_display::esp8266::device_settings::ConnectionMode;
  using codexbar_display::esp8266::device_settings::ResolveInitialConnectionMode;

  const ConnectionMode resolved =
      ResolveInitialConnectionMode(deviceSettings.connectionMode, hasLegacyState);
  if (resolved == deviceSettings.connectionMode) {
    return true;
  }
  deviceSettings.connectionMode = resolved;
  if (!saveDeviceSettings()) {
    Serial.printf(
        "connection_mode_persist_failed mode=%s\n",
        codexbar_display::esp8266::device_settings::ConnectionModeName(resolved));
    return false;
  }
  Serial.printf(
      "connection_mode_migrated mode=%s legacy_state=%d\n",
      codexbar_display::esp8266::device_settings::ConnectionModeName(resolved),
      hasLegacyState ? 1 : 0);
  return true;
}

// Reset-deadline handover across a self-initiated restart.
//
// Written only in the moment the firmware decides to reboot, and consumed once
// on the next boot. That is two LittleFS writes per deliberate restart and none
// per frame, so a ticking countdown never touches flash.
//
// Without a wall clock the device cannot measure how long it was powerless, so
// the record is only honoured after a software restart, where the gap is the
// firmware's own boot. Any other reset reason drops it.
void persistResetTrustForRestart() {
  if (!LittleFS.begin()) {
    return;
  }
  const String record = codexbar_display::core::EncodeResetTrustRecord(runtimeCtx.runtime.reset, millis());
  if (record.length() == 0) {
    LittleFS.remove(kResetTrustHandoverPath);
    return;
  }
  File file = LittleFS.open(kResetTrustHandoverPath, "w");
  if (!file) {
    return;
  }
  file.print(record);
  file.close();
}

