DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
void drawWifiResetStatus(const String& line2) {
  const unsigned long renderStartUs = micros();
  renderer.DrawStatus(runtimeCtx, "VIBE TV RESET", "WiFi reset", line2);
  recordRenderFull("status", micros() - renderStartUs);
}

void drawUpdateStatus(const String& line2) {
  const unsigned long renderStartUs = micros();
  renderer.DrawStatus(runtimeCtx, "VIBE TV UPDATE", "Update running", line2);
  recordRenderFull("update_status", micros() - renderStartUs);
}

bool statusScreenLocked() {
  return otaUploadInProgress || rebootPending;
}

bool wifiSetupRecoveryBusy() {
  return statusScreenLocked() || assetUploadInProgress || setupWifiState.scanInProgress;
}

void finishWifiSetupRecovery() {
  if (captiveDnsStarted) {
    dnsServer.stop();
    captiveDnsStarted = false;
    Serial.println("captive_dns_stopped reason=wifi_reconnected");
  }
  WiFi.softAPdisconnect(true);
  WiFi.mode(WIFI_STA);
  setupMode = false;
  resetWifiReconnectState();
  startHttpServer();
  drawWaitingForCompanionStatus();
  Serial.printf("wifi_setup_retry_connected ip=%s\n", WiFi.localIP().toString().c_str());
}

void maintainWifiSetupRecovery() {
  const unsigned long nowMs = millis();
  codexbar_display::esp8266::wifi_recovery::Inputs inputs;
  inputs.nowMs = static_cast<uint32_t>(nowMs);
  inputs.setupMode = setupMode;
  inputs.credentialsAvailable = savedWifiCredentialsAvailable;
  inputs.busy = wifiSetupRecoveryBusy();
  inputs.connected = WiFi.status() == WL_CONNECTED;

  const codexbar_display::esp8266::wifi_recovery::Action action =
      codexbar_display::esp8266::wifi_recovery::Tick(wifiSetupRecoveryState, inputs);
  switch (action) {
    case codexbar_display::esp8266::wifi_recovery::Action::StartAttempt:
      WiFi.mode(WIFI_AP_STA);
      applyWifiInteropPhyMode();
      WiFi.begin(savedWifiCredentials.ssid, savedWifiCredentials.password);
      Serial.printf("wifi_setup_retry_started ssid=%s\n", savedWifiCredentials.ssid);
      break;
    case codexbar_display::esp8266::wifi_recovery::Action::Timeout:
      WiFi.disconnect(false);
      WiFi.mode(WIFI_AP_STA);
      applyWifiInteropPhyMode();
      WiFi.softAP(kSetupApSsid);
      Serial.printf("wifi_setup_retry_failed status=%d next_retry_ms=%lu\n",
                    static_cast<int>(WiFi.status()),
                    static_cast<unsigned long>(
                        codexbar_display::esp8266::wifi_recovery::kRetryIntervalMs));
      break;
    case codexbar_display::esp8266::wifi_recovery::Action::Connected:
      finishWifiSetupRecovery();
      break;
    case codexbar_display::esp8266::wifi_recovery::Action::None:
      break;
  }
}

void resetWifiReconnectState() {
  wifiDisconnectedAtMs = 0;
  wifiReconnectAttemptAtMs = 0;
  wifiReconnectStatusRendered = false;
}

String displayErrorMessage(const String& message) {
  if (message == "runtime/codexbar-version" || message == "runtime/codexbar-parse") {
    return "Update Mac App";
  }
  if (message == "runtime/codexbar-binary") {
    return "Install Mac App";
  }
  if (message == "runtime/no-providers") {
    return "Open App";
  }
  if (message == "runtime/codexbar-cmd") {
    return "Open App";
  }
  if (message == "runtime/cycle-timeout") {
    return "Open App";
  }
  return "Open App";
}

void renderAcceptedFrame(const codexbar_display::core::SerialConsumeEvent& event) {
  const bool maybeThemeSpecPartial = event.themeSpecPartialRender && !runtimeCtx.screenDirty;
  const unsigned long partialStartUs = maybeThemeSpecPartial ? micros() : 0;
  const unsigned long partialSuccessesBefore =
      maybeThemeSpecPartial ? renderer.DebugSnapshot().themeSpecPartialSuccesses : 0;
  renderer.OnFrameAccepted(runtimeCtx, event);
  if (shouldShowFirmwareUpdateNotice()) {
    // A frame-driven partial repaint may have painted theme content over the
    // visible notice (label line or overlay bar); re-assert it next loop.
    markFirmwareUpdateNoticeDirty();
  }
  if (maybeThemeSpecPartial) {
    const codexbar_display::esp8266::RendererDebugSnapshot snapshot = renderer.DebugSnapshot();
    if (snapshot.themeSpecPartialSuccesses > partialSuccessesBefore && !runtimeCtx.screenDirty) {
      recordRenderPartial("theme_spec_frame", micros() - partialStartUs);
    }
  }
}

void maintainDeviceClock() {
  const unsigned long nowMs = millis();
  if (static_cast<long>(nowMs - nextDeviceClockPollAtMs) < 0) {
    return;
  }
  nextDeviceClockPollAtMs = nowMs + kDeviceClockPollMs;

  const time_t systemEpoch = time(nullptr);
  if (deviceclock::ObserveSystemEpoch(runtimeCtx.clock, static_cast<int64_t>(systemEpoch), nowMs)) {
    Serial.printf("clock_synced epoch=%ld utc_offset_known=%d\n",
                  static_cast<long>(systemEpoch),
                  runtimeCtx.clock.hasUtcOffset ? 1 : 0);
  }

  if (deviceclock::ApplyDueUtcOffsetTransition(
          runtimeCtx.clock, deviceclock::UtcNow(runtimeCtx.clock, nowMs))) {
    Serial.printf("clock_utc_offset_transition_applied minutes=%d\n",
                  static_cast<int>(runtimeCtx.clock.utcOffsetMinutes));
    saveDeviceSettings();
  }

  char timeText[deviceclock::kTimeTextSize];
  char dateText[deviceclock::kDateTextSize];
  codexbar_display::app::ClockTimeText(runtimeCtx, nowMs, timeText, sizeof(timeText));
  codexbar_display::app::ClockDateText(runtimeCtx, nowMs, dateText, sizeof(dateText));
  if (strcmp(timeText, renderedClockTime) == 0 && strcmp(dateText, renderedClockDate) == 0) {
    return;
  }
  strcpy(renderedClockTime, timeText);
  strcpy(renderedClockDate, dateText);

  if (setupMode ||
      waitStatusRendered ||
      frameStaleStatusRendered ||
      runtimeCtx.screenDirty ||
      !codexbar_display::app::HasFrame(runtimeCtx) ||
      codexbar_display::app::CurrentFrame(runtimeCtx).hasError) {
    return;
  }
  const unsigned long renderStartUs = micros();
  if (renderer.DrawClock(runtimeCtx)) {
    recordRenderPartial("clock", micros() - renderStartUs);
  }
}

bool acceptedFrameRenderDeferredForTransport(const char* transport) {
  if (transport == nullptr) {
    return false;
  }
  return strcmp(transport, "wifi") == 0 ||
         strcmp(transport, "theme") == 0;
}

void markFrameAccepted(const codexbar_display::core::SerialConsumeEvent& event, const char* transport) {
  if (statusScreenLocked()) {
    Serial.printf("frame_ignored transport=%s reason=status_screen_locked\n", transport);
    return;
  }

  const bool redrawAfterStatus = waitStatusRendered || frameStaleStatusRendered;
  waitStatusRendered = false;
  frameStaleStatusRendered = false;
  if (redrawAfterStatus) {
    // A setup or OTA status screen covers the whole display. Never apply a
    // partial ThemeSpec update on top of it; the first accepted frame must
    // rebuild the complete customer screen.
    runtimeCtx.screenDirty = true;
  }
  lastFrameAcceptedAtMs = millis();
  // Loading a stored ThemeSpec is an internal screen transition. In
  // particular, entering standby must not count as fresh customer usage or the
  // next loop immediately exits standby and restores the live theme again.
  // Real Wi-Fi and USB usage frames still reset the idle timer as before.
  //
  // The activity clock reads the frame's own `activity` verdict rather than
  // inferring one from usage percentages. Percentages are whole numbers, so a
  // customer coding against a weekly quota can work for a long time before the
  // value ticks over, and standby would keep the screensaver up while they
  // type. The Companion already decides this honestly, with its own hold and
  // idle-evidence rules; the device just uses that answer.
  if (event.reportsWorking && strcmp(transport, "theme") != 0) {
    standby::NoteUsageActivity(standbyState, lastFrameAcceptedAtMs);
  }
  // SNTP delivers UTC only. The Companion supplies the current local date/time
  // for fallback display, its current offset, and the next two transitions;
  // the device stores and consumes those against its own SNTP epoch.
  const codexbar_display::core::Frame& currentFrame =
      codexbar_display::app::CurrentFrame(runtimeCtx);
  const bool clockOffsetChanged = deviceclock::ObserveCompanionClock(
      runtimeCtx.clock,
      currentFrame.timeText.c_str(),
      currentFrame.hasClockSchedule,
      static_cast<int>(currentFrame.clockOffsetMinutes),
      lastFrameAcceptedAtMs);
  bool clockScheduleChanged = false;
  if (currentFrame.hasClockSchedule && currentFrame.clockTransitionEpoch > 0) {
    clockScheduleChanged = deviceclock::ObserveUtcOffsetTransition(
        runtimeCtx.clock,
        currentFrame.clockTransitionEpoch,
        currentFrame.clockTransitionOffsetMinutes,
        currentFrame.clockFollowingTransitionEpoch,
        currentFrame.clockFollowingTransitionOffsetMinutes);
  } else if (currentFrame.hasClockSchedule) {
    // A valid current offset without a next transition explicitly retires a
    // previously persisted schedule (for example after leaving DST).
    clockScheduleChanged = deviceclock::ClearUtcOffsetTransition(runtimeCtx.clock);
  }
  const bool clockTransitionApplied = deviceclock::ApplyDueUtcOffsetTransition(
      runtimeCtx.clock, deviceclock::UtcNow(runtimeCtx.clock, lastFrameAcceptedAtMs));
  if (clockTransitionApplied) {
    Serial.printf("clock_utc_offset_transition_applied minutes=%d\n",
                  static_cast<int>(runtimeCtx.clock.utcOffsetMinutes));
  }
  if (clockOffsetChanged) {
    Serial.printf("clock_utc_offset_learned minutes=%d\n",
                  static_cast<int>(runtimeCtx.clock.utcOffsetMinutes));
  }
  if (clockOffsetChanged || clockScheduleChanged || clockTransitionApplied) {
    saveDeviceSettings();
  }
  applyFrameUpdateState();
  if (event.themeSpecChanged) {
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
    if (codexbar_display::app::HasFrame(runtimeCtx) &&
        codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec) {
      const String& raw = codexbar_display::app::CurrentFrame(runtimeCtx).themeSpecRaw;
      if (raw.length() > 0) {
        activeThemeSpecHash = hashHex8(raw);
      }
    } else {
      activeThemeSpecPath = "";
      activeThemeSpecHash = "";
    }
#else
    activeThemeSpecPath = "";
    activeThemeSpecHash = "";
#endif
  }

  const bool deferRender = acceptedFrameRenderDeferredForTransport(transport);
  if (deferRender && event.visualChanged) {
    // ESP8266WebServer invokes WiFi frame and theme activation callbacks from
    // handleClient(). Keep display work out of those callbacks so HTTP can ACK.
    pendingHttpRenderEvent = event;
    pendingHttpRender = true;
  } else if (!deferRender) {
    renderAcceptedFrame(event);
  }
  Serial.printf("frame_received transport=%s\n", transport);
}

