DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
  webServer.send(200, "text/html; charset=utf-8", "<!doctype html><p>WiFi settings cleared. Vibe TV is restarting setup.</p>");
  drawWifiResetStatus("Restarting");
  waitStatusRendered = true;
  delay(500);
  clearWifiCredentials();
  clearSdkWifiCredentials();
  delay(250);
  persistResetTrustForRestart();
  ESP.restart();
}

void addCorsHeaders() {
  webServer.keepAlive(false);
  webServer.sendHeader("Access-Control-Allow-Origin", "*");
  webServer.sendHeader("Access-Control-Allow-Methods", "GET,POST,DELETE,OPTIONS");
  webServer.sendHeader("Access-Control-Allow-Headers", String("Content-Type,") + kDeviceAuthHeader);
}

void handleHello() {
  addCorsHeaders();
  if (requestAuthToken().length() > 0 && !requireWriteAuth()) {
    return;
  }

  const String out = codexbar_display::app::BuildDeviceHelloJSON(
      makeTransportConfig("wifi"));
  webServer.send(200, "application/json", out);
}

bool parseConnectionModeRequest(
    device_settings::ConnectionMode& mode,
    String& expectedDeviceID,
    String& error) {
  JsonDocument doc;
  if (deserializeJson(doc, webServer.arg("plain"))) {
    error = "invalid JSON body";
    return false;
  }
  expectedDeviceID = String(doc["deviceId"] | "");
  mode = requestedConnectionMode(String(doc["mode"] | ""));
  if (expectedDeviceID != deviceID) {
    error = "deviceId does not match";
    return false;
  }
  if (mode == device_settings::ConnectionMode::kUnspecified) {
    error = "mode must be cable or wifi";
    return false;
  }
  return true;
}

void handleConnectionModeSwitch() {
  addCorsHeaders();
  if (!requireWriteAuth()) {
    return;
  }
  device_settings::ConnectionMode target =
      device_settings::ConnectionMode::kUnspecified;
  String expectedDeviceID;
  String error;
  if (!parseConnectionModeRequest(target, expectedDeviceID, error) ||
      !beginConnectionTransition(target, error)) {
    webServer.send(400, "text/plain; charset=utf-8", error);
    return;
  }
  String out;
  out.reserve(180);
  out += "{\"ok\":true,\"deviceId\":\"";
  out += deviceID;
  out += "\",\"mode\":\"";
  out += device_settings::ConnectionModeName(target);
  out += "\",\"confirmationRequired\":true}";
  webServer.send(202, "application/json", out);
  scheduleReboot("connection_mode_switch");
}

void handleConnectionModeConfirmation() {
  addCorsHeaders();
  if (!requireWriteAuth()) {
    return;
  }
  JsonDocument doc;
  if (deserializeJson(doc, webServer.arg("plain"))) {
    webServer.send(400, "text/plain; charset=utf-8", "invalid JSON body");
    return;
  }
  String status;
  if (!confirmConnectionTransition(String(doc["deviceId"] | ""), status)) {
    webServer.send(409, "text/plain; charset=utf-8", status);
    return;
  }
  String out = "{\"ok\":true,\"deviceId\":\"";
  out += deviceID;
  out += "\",\"mode\":\"";
  out += device_settings::ConnectionModeName(deviceSettings.connectionMode);
  out += "\",\"status\":\"";
  out += status;
  out += "\"}";
  webServer.send(200, "application/json", out);
}

void emitSerialStatus() {
  String out;
  out.reserve(240);
  out += "{\"kind\":\"status\",\"deviceId\":\"";
  out += deviceID;
  out += "\",\"board\":\"";
  out += CODEXBAR_DISPLAY_BOARD_ID;
  out += "\",\"firmware\":\"";
  out += CODEXBAR_DISPLAY_FW_VERSION;
  out += "\",\"connectionMode\":\"";
  out += codexbar_display::esp8266::device_settings::ConnectionModeName(
      deviceSettings.connectionMode);
  out += "\",\"transitionPending\":";
  out += connectionTransitionPending ? "true" : "false";
  out += ",\"transport\":\"usb\",\"hasFrame\":";
  out += codexbar_display::app::HasFrame(runtimeCtx) ? "true" : "false";
  out += "}";
  Serial.println(out);
}

void emitSerialError(const char* code) {
  String out = "{\"kind\":\"error\",\"code\":\"";
  out += code;
  out += "\"}";
  Serial.println(out);
}

void emitSerialConnectionMode(
    const String& status,
    device_settings::ConnectionMode mode,
    bool confirmationRequired) {
  String out = "{\"kind\":\"connection-mode\",\"status\":\"";
  out += status;
  out += "\",\"deviceId\":\"";
  out += deviceID;
  out += "\",\"mode\":\"";
  out += device_settings::ConnectionModeName(mode);
  if (confirmationRequired) {
    out += "\",\"confirmationRequired\":true}";
  } else {
    out += "\"}";
  }
  Serial.println(out);
}

struct DeviceSettingsPatch {
  bool hasBrightness = false;
  int brightnessPercent = 0;
  bool hasStandbyEnabled = false;
  bool standbyEnabled = false;
  bool hasStandbyTimeout = false;
  int standbyTimeoutMinutes = 0;
  bool hasStandbyBrightness = false;
  int standbyBrightnessPercent = 0;
  bool hasScreensaverPath = false;
  String screensaverPath;
};

bool applyDeviceSettingsPatch(const DeviceSettingsPatch& patch, String& error);

bool handleSerialControlLine(const String& line) {
  JsonDocument doc;
  if (deserializeJson(doc, line)) {
    return false;
  }
  const char* kind = doc["kind"] | "";
  if (strcmp(kind, "request") != 0) {
    return false;
  }

  const char* op = doc["op"] | "";
  if (strcmp(op, "hello") == 0) {
    codexbar_display::app::EmitDeviceHello(makeTransportConfig("usb"));
  } else if (strcmp(op, "status") == 0) {
    emitSerialStatus();
  } else if (strcmp(op, "set-connection-mode") == 0) {
    const char* expectedDeviceID = doc["deviceId"] | "";
    const device_settings::ConnectionMode target =
        requestedConnectionMode(String(doc["mode"] | ""));
    String error;
    if (strcmp(expectedDeviceID, deviceID.c_str()) != 0) {
      error = "deviceId does not match";
    } else if (!beginConnectionTransition(target, error)) {
      // beginConnectionTransition supplies the customer-safe reason.
    }
    if (error.length() > 0) {
      emitSerialError("connection-mode-rejected");
    } else {
      emitSerialConnectionMode("switching", target, true);
      scheduleReboot("connection_mode_switch");
    }
  } else if (strcmp(op, "confirm-connection-mode") == 0) {
    String status;
    if (!confirmConnectionTransition(String(doc["deviceId"] | ""), status)) {
      emitSerialError("connection-mode-confirmation-rejected");
    } else {
      emitSerialConnectionMode(status, deviceSettings.connectionMode, false);
    }
  } else if (strcmp(op, "settings") == 0) {
    const char* expectedDeviceID = doc["deviceId"] | "";
    String error;
    bool rejected = strcmp(expectedDeviceID, deviceID.c_str()) != 0;
    const char* settingsKey = "settings";
    const JsonVariantConst settings = doc[settingsKey];
    if (!rejected && !settings.isNull()) {
      DeviceSettingsPatch patch;
      const char* brightnessPercent = "brightnessPercent";
      const JsonVariantConst brightness = settings[brightnessPercent];
      if (!brightness.isNull()) {
        patch.hasBrightness = true;
        patch.brightnessPercent = brightness.as<int>();
      }
      const char* standby = "standby";
      const JsonVariantConst standbyPatch = settings[standby];
      if (!standbyPatch.isNull()) {
        const char* enabled = "enabled";
        const JsonVariantConst standbyEnabled = standbyPatch[enabled];
        if (!standbyEnabled.isNull()) {
          patch.hasStandbyEnabled = true;
          patch.standbyEnabled = standbyEnabled.as<bool>();
        }
        const char* timeoutMinutes = "timeoutMinutes";
        const JsonVariantConst standbyTimeout = standbyPatch[timeoutMinutes];
        if (!standbyTimeout.isNull()) {
          patch.hasStandbyTimeout = true;
          patch.standbyTimeoutMinutes = standbyTimeout.as<int>();
        }
        const JsonVariantConst standbyBrightness = standbyPatch[brightnessPercent];
        if (!standbyBrightness.isNull()) {
          patch.hasStandbyBrightness = true;
          patch.standbyBrightnessPercent = standbyBrightness.as<int>();
        }
        const char* screensaverPath = "screensaverPath";
        const JsonVariantConst standbyScreensaver = standbyPatch[screensaverPath];
        if (!standbyScreensaver.isNull()) {
          patch.hasScreensaverPath = true;
          patch.screensaverPath = String(standbyScreensaver | "");
        }
      }
      rejected = !applyDeviceSettingsPatch(patch, error);
    }
    if (rejected) {
      emitSerialError("settings-rejected");
    } else {
      String out = "{\"kind\":\"settings\",\"deviceId\":\"";
      out += deviceID;
      out += "\",";
      appendSettingsJSON(out);
      out += "}";
      Serial.println(out);
    }
  } else if (strcmp(op, "configure-wifi") == 0) {
    const char* expectedDeviceID = doc["deviceId"] | "";
    String ssid = String(doc["ssid"] | "");
    const String password = String(doc["password"] | "");
    ssid.trim();
    String error;
    const device_settings::ConnectionMode target =
        device_settings::ConnectionMode::kWifi;
    bool rejected = strcmp(expectedDeviceID, deviceID.c_str()) != 0 ||
                    ssid.length() == 0 ||
                    ssid.length() >= kWifiSsidBytes ||
                    password.length() >= kWifiPasswordBytes ||
                    deviceSettings.connectionMode !=
                        device_settings::ConnectionMode::kCable;
    if (!rejected && !saveWifiCredentials(ssid, password)) {
      rejected = true;
    }
    if (!rejected && !beginConnectionTransition(target, error)) {
      rejected = true;
    }
    if (rejected) {
      emitSerialError("wifi-configuration-rejected");
    } else {
      emitSerialConnectionMode("switching", target, true);
      scheduleReboot("wifi_credentials_saved");
    }
  } else {
    emitSerialError("unsupported-request");
  }
  return true;
}

void handleSerialInput() {
  String line;
  if (!codexbar_display::app::ReadSerialLine(runtimeCtx, line)) {
    return;
  }
  if (handleSerialControlLine(line)) {
    return;
  }
  if (!codexbar_display::esp8266::device_settings::SupportsCable(
          deviceSettings.connectionMode) ||
      deviceSettings.connectionMode !=
          codexbar_display::esp8266::device_settings::ConnectionMode::kCable) {
    return;
  }

  codexbar_display::core::SerialConsumeEvent event;
  if (codexbar_display::core::ConsumeFrameLine(
          runtimeCtx.runtime, line.c_str(), millis(), event) &&
      event.frameAccepted) {
    markFrameAccepted(event, "usb");
  }
}

bool isSafeAssetPath(const String& path) {
  return codexbar_display::esp8266::AssetPathPolicy::IsSafeSyntax(path.c_str(), path.length());
}

bool isMutableThemeAssetPath(const String& path) {
  return codexbar_display::esp8266::AssetPathPolicy::IsMutableThemeAsset(path.c_str(), path.length());
}

bool isLiveThemeSpecPath(const String& path) {
  return codexbar_display::esp8266::AssetPathPolicy::IsLiveThemeSpecPath(path.c_str(), path.length());
}

