DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
bool storedThemeSpecReferencesAsset(const String& themeSpecPath, const String& assetPath);

void handleAssetDelete() {
  if (!requireWriteAuth()) {
    return;
  }
  String path = webServer.arg("path");
  path.trim();
  if (!isMutableThemeAssetPath(path)) {
    addCorsHeaders();
    webServer.send(400, "text/plain; charset=utf-8", "invalid asset path");
    return;
  }
  if (!LittleFS.begin()) {
    addCorsHeaders();
    webServer.send(500, "text/plain; charset=utf-8", "filesystem mount failed");
    return;
  }
  if (!LittleFS.exists(path)) {
    addCorsHeaders();
    webServer.send(404, "text/plain; charset=utf-8", "asset not found");
    return;
  }
  // Every path that owns the screen, or holds the way back to it, protects the
  // assets its spec references and not just the spec file: a sprite deleted
  // while standby or the post-install preview is up comes back as a silent
  // hole on wake. Empty paths short-circuit inside
  // storedThemeSpecReferencesAsset, so the standby and preview lookups cost
  // nothing while neither holds the screen.
  const String configuredScreensaverPath(deviceSettings.standby.screensaverPath);
  if (path == activeThemeSpecPath || path == standbyLiveThemePath ||
      path == screensaverPreviewLivePath ||
      path == configuredScreensaverPath ||
      storedThemeSpecReferencesAsset(configuredScreensaverPath, path) ||
      storedThemeSpecReferencesAsset(activeThemeSpecPath, path) ||
      storedThemeSpecReferencesAsset(standbyLiveThemePath, path) ||
      storedThemeSpecReferencesAsset(screensaverPreviewLivePath, path)) {
    addCorsHeaders();
    webServer.send(409, "text/plain; charset=utf-8", "asset is active");
    return;
  }
  renderer.ResetGifStateForAssetUpdate();
  if (!LittleFS.remove(path)) {
    addCorsHeaders();
    webServer.send(500, "text/plain; charset=utf-8", "asset delete failed");
    return;
  }
  Serial.printf("asset_deleted path=%s\n", path.c_str());
  addCorsHeaders();
  webServer.send(200, "application/json", "{\"ok\":true}");
}

#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
bool readActiveThemeSpecPath(String& path) {
  path = "";
  if (!LittleFS.begin() || !LittleFS.exists(kActiveThemeSpecPathFile)) {
    return false;
  }
  File file = LittleFS.open(kActiveThemeSpecPathFile, "r");
  if (!file) {
    return false;
  }
  path = file.readString();
  file.close();
  path.trim();
  return isLiveThemeSpecPath(path);
}

bool saveActiveThemeSpecPath(const String& path) {
  if (!isLiveThemeSpecPath(path)) {
    return false;
  }
  if (!LittleFS.begin()) {
    return false;
  }
  File file = LittleFS.open(kActiveThemeSpecPathFile, "w");
  if (!file) {
    return false;
  }
  const size_t written = file.print(path);
  file.close();
  return written == path.length();
}

bool readStoredThemeSpec(const String& path, String& raw, String& error) {
  if (!isSafeAssetPath(path) || !path.startsWith("/themes/")) {
    error = "invalid theme path";
    return false;
  }
  if (!LittleFS.begin()) {
    error = "filesystem mount failed";
    return false;
  }
  if (!LittleFS.exists(path)) {
    error = "theme file not found";
    return false;
  }

  File file = LittleFS.open(path, "r");
  if (!file) {
    error = "open theme file failed";
    return false;
  }
  const size_t size = file.size();
  if (size == 0 || size > kMaxStoredThemeSpecBytes) {
    file.close();
    error = "theme file too large";
    return false;
  }
  raw = file.readString();
  file.close();
  raw.trim();

  // Devices upgraded from 1.0.36 can still have this explicitly active Mini
  // spec. Keep its label compatibility without treating it as a boot fallback.
  if (path == kLegacyMiniThemeSpecPath) {
    raw.replace("\"v\":\"left\"", "\"v\":\"{usageMode}\"");
  }
  if (raw.length() == 0 || raw.length() > kMaxStoredThemeSpecBytes) {
    error = "theme file too large";
    return false;
  }
  return true;
}

bool themeSpecMetadata(const String& raw, String& themeId, int& themeRev, String& error) {
  JsonDocument filter;
  filter["themeId"] = true;
  filter["id"] = true;
  filter["themeRev"] = true;
  filter["rev"] = true;

  JsonDocument doc;
  const DeserializationError err = deserializeJson(doc, raw, DeserializationOption::Filter(filter));
  if (err) {
    error = String("bad theme json: ") + err.c_str();
    return false;
  }
  JsonObjectConst spec = doc.as<JsonObjectConst>();
  if (spec.isNull()) {
    error = "theme json must be an object";
    return false;
  }

  const char* id = nullptr;
  if (spec["themeId"].is<const char*>()) {
    id = spec["themeId"].as<const char*>();
  } else if (spec["id"].is<const char*>()) {
    id = spec["id"].as<const char*>();
  }
  if (id != nullptr) {
    themeId = String(id);
    themeId.trim();
  }
  themeRev = static_cast<int>(spec["themeRev"] | spec["rev"] | 0);
  if (themeId.length() == 0 || themeRev <= 0) {
    error = "theme id/rev missing";
    return false;
  }

  return true;
}

bool prepareStoredThemeSpec(
    const String& raw,
    const String& themeId,
    int themeRev,
    codexbar_display::core::RuntimeState& nextRuntime,
    codexbar_display::core::SerialConsumeEvent& event) {
  nextRuntime = runtimeCtx.runtime;
  return codexbar_display::core::RestoreStoredThemeSpecFrame(
      nextRuntime, themeId, themeRev, raw, millis(), event);
}

void commitStoredThemeSpec(
    const String& path,
    const String& raw,
    const codexbar_display::core::RuntimeState& nextRuntime,
    const codexbar_display::core::SerialConsumeEvent& event) {
  runtimeCtx.runtime = nextRuntime;
  renderer.ResetGifStateForAssetUpdate();
  activeThemeSpecPath = path;
  activeThemeSpecHash = hashHex8(raw);
  markFrameAccepted(event, "theme");
}

bool readValidatedStoredThemeSpec(
    const String& path,
    String& raw,
    String& themeId,
    int& themeRev,
    String& error) {
  if (!readStoredThemeSpec(path, raw, error)) {
    return false;
  }
  if (!themeSpecMetadata(raw, themeId, themeRev, error)) {
    return false;
  }
  JsonDocument doc;
  codexbar_display::themespec::CompiledThemeSpec scene;
  const bool renderable = codexbar_display::themespec::CompileThemeSpec(raw.c_str(), doc, scene);
  codexbar_display::themespec::ReleaseCompiledThemeSpec(scene);
  if (!renderable) {
    error = "theme spec has no renderable content";
    return false;
  }
  return true;
}

void activateStoredThemeSpec(const String& path, const String& raw, const String& themeId, int themeRev) {
  codexbar_display::core::SerialConsumeEvent event;
  if (!codexbar_display::core::RestoreStoredThemeSpecFrame(
          runtimeCtx.runtime, themeId, themeRev, raw, millis(), event)) {
    return;
  }
  renderer.ResetGifStateForAssetUpdate();
  activeThemeSpecPath = path;
  activeThemeSpecHash = hashHex8(raw);
  markFrameAccepted(event, "theme");
}

// `persist` is false for standby transitions: the customer's live theme choice
// must survive the screensaver, and a flash write per transition would be wear
// for nothing.
bool activateStoredThemePath(
    const String& path, bool persist, String& themeId, int& themeRev, String& error) {
  String raw;
  if (!readValidatedStoredThemeSpec(path, raw, themeId, themeRev, error)) {
    return false;
  }
  codexbar_display::core::RuntimeState nextRuntime;
  codexbar_display::core::SerialConsumeEvent event;
  if (!prepareStoredThemeSpec(raw, themeId, themeRev, nextRuntime, event)) {
    error = "theme spec not renderable";
    return false;
  }
  if (persist && !saveActiveThemeSpecPath(path)) {
    error = "save active theme failed";
    return false;
  }
  commitStoredThemeSpec(path, raw, nextRuntime, event);
  return true;
}

bool renderStoredThemeSpecForStandby(const String& path) {
  String themeId;
  int themeRev = 0;
  String error;
  if (activateStoredThemePath(path, false, themeId, themeRev, error)) {
    return true;
  }
  Serial.printf("standby_load_failed path=%s err=%s\n", path.c_str(), error.c_str());
  return false;
}

#endif

bool storedThemeSpecReferencesAsset(const String& themeSpecPath, const String& assetPath) {
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  if (themeSpecPath.length() == 0 || assetPath.length() == 0) {
    return false;
  }
  String raw;
  String error;
  if (!readStoredThemeSpec(themeSpecPath, raw, error)) {
    return false;
  }
  JsonDocument doc;
  codexbar_display::themespec::CompiledThemeSpec scene;
  const bool compiled = codexbar_display::themespec::CompileThemeSpec(raw.c_str(), doc, scene);
  const bool referenced = compiled &&
      codexbar_display::themespec::CompiledThemeSpecReferencesAsset(scene, assetPath.c_str());
  codexbar_display::themespec::ReleaseCompiledThemeSpec(scene);
  return referenced;
#else
  (void)themeSpecPath;
  (void)assetPath;
  return false;
#endif
}

void handleThemeActive() {
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  if (!requireWriteAuth()) {
    return;
  }
  const bool formMode = webServer.hasArg("path");
  String path = webServer.arg("path");
  if (!formMode) {
    String body = webServer.arg("plain");
    body.trim();
    if (body.length() == 0 || body.length() > 160) {
      addCorsHeaders();
      webServer.send(400, "text/plain; charset=utf-8", "invalid theme activation body");
      return;
    }

    JsonDocument doc;
    const DeserializationError err = deserializeJson(doc, body);
    if (err) {
      addCorsHeaders();
      webServer.send(400, "text/plain; charset=utf-8", "bad theme activation json");
      return;
    }
    path = String(doc["path"] | "");
  }
  path.trim();

