DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
  String themeId;
  int themeRev = 0;
  String error;
  if (!activateStoredThemePath(path, true, themeId, themeRev, error)) {
    addCorsHeaders();
    webServer.send(error == "theme file not found" ? 404 : 400, "text/plain; charset=utf-8", error);
    return;
  }
  // The customer just picked the live theme, so it is now the screen standby
  // has to hand back — and standby ends here rather than dimming that choice.
  // A running preview loses its claim with it: the newly activated theme is
  // already on screen, so there is nothing to restore, and its deadline must
  // not repaint the previously captured theme over this choice.
  screensaver_preview::Cancel(screensaverPreviewState);
  screensaverPreviewLivePath = "";
  standbyLiveThemePath = "";
  standbyState.active = false;
  standby::NoteUsageActivity(standbyState, millis());
  applyDeviceSettings();

  if (formMode) {
    webServer.keepAlive(false);
    webServer.sendHeader("Location", "/");
    webServer.send(303);
    return;
  }

  String out;
  out.reserve(160);
  out += "{\"ok\":true,\"path\":\"";
  out += jsonEscape(path);
  out += "\",\"id\":\"";
  out += jsonEscape(themeId);
  out += "\",\"rev\":";
  out += String(themeRev);
  out += ",\"hash\":\"";
  out += jsonEscape(activeThemeSpecHash);
  out += "\"";
  out += "}";
  addCorsHeaders();
  webServer.send(200, "application/json", out);
#else
  addCorsHeaders();
  webServer.send(501, "text/plain; charset=utf-8", "theme spec renderer disabled");
#endif
}

// Selects which stored ThemeSpec the screensaver slot points at. Mirrors the
// /theme/active contract but touches a different, independent slot: it never
// changes the live theme and never renders anything. Standby rendering is the
// state machine's job.
void handleScreensaverActive() {
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  addCorsHeaders();
  if (!requireWriteAuth()) {
    return;
  }
  String body = webServer.arg("plain");
  body.trim();
  if (body.length() == 0 || body.length() > 160) {
    webServer.send(400, "text/plain; charset=utf-8", "invalid screensaver activation body");
    return;
  }

  JsonDocument doc;
  const DeserializationError err = deserializeJson(doc, body);
  if (err) {
    webServer.send(400, "text/plain; charset=utf-8", "bad screensaver activation json");
    return;
  }
  String path = String(doc["path"] | "");
  path.trim();

  DeviceSettings next = deviceSettings;
  String error;
  if (!setStandbyScreensaverPath(next.standby, path, error)) {
    webServer.send(error == "screensaver file not found" ? 404 : 400,
                   "text/plain; charset=utf-8", error);
    return;
  }
  if (!persistDeviceSettings(next)) {
    webServer.send(500, "text/plain; charset=utf-8", "save failed");
    return;
  }
  // Never rendered here: ESP8266WebServer runs handlers inside handleClient(),
  // where display work does not belong. The loop shows the preview.
  //
  // Clearing the slot is deliberately NOT cancelled here. An install clears the
  // selection before it overwrites the pack's files, and cancelling would drop
  // `showing` — the loop could then never hand the screen back, leaving the
  // screensaver up while its files are rewritten. Left alone, the empty slot
  // reads as a veto in maintainScreensaverPreview, which restores properly.
  if (standby::HasScreensaver(deviceSettings.standby)) {
    screensaver_preview::NoteSelection(screensaverPreviewState);
  }

  String out;
  out.reserve(120);
  out += "{\"ok\":true,\"path\":";
  if (standby::HasScreensaver(deviceSettings.standby)) {
    out += "\"";
    out += jsonEscape(String(deviceSettings.standby.screensaverPath));
    out += "\"";
  } else {
    out += "null";
  }
  out += "}";
  webServer.send(200, "application/json", out);
#else
  addCorsHeaders();
  webServer.send(501, "text/plain; charset=utf-8", "theme spec renderer disabled");
#endif
}

#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
bool loadStoredThemeSpecCacheFromPath(const String& path) {
  String error;
  String raw;
  if (!readStoredThemeSpec(path, raw, error)) {
    Serial.printf("theme_cache_load_failed path=%s err=%s\n", path.c_str(), error.c_str());
    return false;
  }

  String themeId;
  int themeRev = 0;
  if (!themeSpecMetadata(raw, themeId, themeRev, error)) {
    Serial.printf("theme_cache_load_failed path=%s err=%s\n", path.c_str(), error.c_str());
    return false;
  }

  activateStoredThemeSpec(path, raw, themeId, themeRev);
  Serial.printf("theme_cache_loaded path=%s id=%s rev=%d\n", path.c_str(), themeId.c_str(), themeRev);
  return true;
}

void loadActiveStoredThemeSpecCache() {
  String activePath;
  if (!readActiveThemeSpecPath(activePath)) {
    return;
  }
  (void)loadStoredThemeSpecCacheFromPath(activePath);
}

// Standby only takes a screen it can hand back. Setup and error frames stay
// where they are, and without a stored live theme there would be no way home.
// The connected "Open App" screen is intentionally not a veto: replacing it
// while the Mac is off is the screensaver's main job.
bool standbyReady() {
  return !setupMode &&
         !codexbar_display::app::CurrentFrame(runtimeCtx).hasError &&
         activeThemeSpecPath.length() > 0;
}

// Hands the screen back to the theme a screensaver preview replaced and drops
// the captured path. Rendering is skipped when that theme is already up.
void restoreScreensaverPreviewLiveTheme() {
  if (screensaverPreviewLivePath.length() > 0 &&
      screensaverPreviewLivePath != activeThemeSpecPath) {
    renderStoredThemeSpecForStandby(screensaverPreviewLivePath);
  }
  screensaverPreviewLivePath = "";
}
#endif

// Shows a freshly selected screensaver once, for a bounded moment, then hands
// the screen back to the live theme. Decided in the loop, never in an HTTP
// handler, mirroring maintainStandby. The loaded spec keeps receiving live
// field updates while it is up — same contract as standby rendering.
void maintainScreensaverPreview() {
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  const bool hasError = codexbar_display::app::HasFrame(runtimeCtx) &&
                        codexbar_display::app::CurrentFrame(runtimeCtx).hasError;
  const bool statusSurfaceVisible = setupMode || waitStatusRendered;
  const String screensaverPath(deviceSettings.standby.screensaverPath);
  // "Already on screen" only means "nothing to preview" BEFORE the preview
  // owns the display: once it does, activeThemeSpecPath points at the
  // screensaver itself and must not veto its own preview.
  const bool selectionUnpreviewable =
      screensaverPath.length() == 0 || activeThemeSpecPath.length() == 0 ||
      (!screensaverPreviewState.showing &&
       screensaverPath == activeThemeSpecPath);
  // Standby, error frames, and setup/status surfaces own the display and share
  // one deferred way back: standbyLiveThemePath, which maintainStandby paints
  // as soon as the blocker clears. Repainting the live theme here instead
  // would erase the screen they just took.
  const bool blockerOwnsDisplay =
      standbyState.active || hasError || statusSurfaceVisible;
  // A disabled screensaver toggle is a customer promise: nothing screensaver-
  // shaped appears, so it also vetoes (and, while showing, immediately ends)
  // the post-install preview.
  const bool blocked = !deviceSettings.standby.enabled || blockerOwnsDisplay ||
                       selectionUnpreviewable;
  const screensaver_preview::Action action = screensaver_preview::Tick(
      screensaverPreviewState, blocked, millis());
  if (action == screensaver_preview::Action::Show) {
    // A reselection mid-preview keeps the first captured path: by now
    // activeThemeSpecPath is the screensaver that is being previewed.
    const String livePath = screensaverPreviewLivePath.length() > 0
                                ? screensaverPreviewLivePath
                                : activeThemeSpecPath;
    if (renderStoredThemeSpecForStandby(screensaverPath)) {
      screensaverPreviewLivePath = livePath;
      Serial.printf("screensaver_preview shown path=%s\n", screensaverPath.c_str());
    } else {
      // Nothing new is on screen, but a preview replacing another one still
      // holds a live theme that has to come back.
      screensaver_preview::Cancel(screensaverPreviewState);
      restoreScreensaverPreviewLiveTheme();
    }
  } else if (action == screensaver_preview::Action::Restore) {
    Serial.printf("screensaver_preview restored path=%s\n", screensaverPreviewLivePath.c_str());
    if (blockerOwnsDisplay) {
      standbyLiveThemePath = screensaverPreviewLivePath;
      screensaverPreviewLivePath = "";
    } else {
      restoreScreensaverPreviewLiveTheme();
    }
  }
#endif
}

