DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
#ifdef CODEXBAR_DISPLAY_RUNTIME_BENCH
struct RuntimeBenchWindow {
  unsigned long windowStartMs = 0;
  unsigned long loopCount = 0;
  unsigned long renderCount = 0;
  unsigned long loopCpuMaxUs = 0;
  unsigned long renderMaxUs = 0;
};

RuntimeBenchWindow benchWindow;

void recordBench(unsigned long loopStartUs, bool rendered, unsigned long renderUs) {
  const unsigned long nowMs = millis();
  if (benchWindow.windowStartMs == 0) {
    benchWindow.windowStartMs = nowMs;
  }

  const unsigned long loopCpuUs = micros() - loopStartUs;
  benchWindow.loopCount++;
  if (loopCpuUs > benchWindow.loopCpuMaxUs) {
    benchWindow.loopCpuMaxUs = loopCpuUs;
  }

  if (rendered) {
    benchWindow.renderCount++;
    if (renderUs > benchWindow.renderMaxUs) {
      benchWindow.renderMaxUs = renderUs;
    }
  }

  if (nowMs - benchWindow.windowStartMs >= 60000UL) {
    Serial.printf(
        "bench board=%s loops=%lu renders=%lu loop_cpu_us_max=%lu render_us_max=%lu\n",
        CODEXBAR_DISPLAY_BOARD_ID,
        benchWindow.loopCount,
        benchWindow.renderCount,
        benchWindow.loopCpuMaxUs,
        benchWindow.renderMaxUs);

    benchWindow = {};
    benchWindow.windowStartMs = nowMs;
  }
}
#endif

}  // namespace

void setup() {
  Serial.begin(115200);
  delay(200);
  bootResetReasonJSON = "\"";
  bootResetReasonJSON += jsonEscape(ESP.getResetReason());
  bootResetReasonJSON += "\"";
  bootResetCounter = incrementBootResetCounter();
  deviceID = String(ESP.getChipId());
  bootID = String(ESP.getChipId(), HEX);
  bootID += "-";
  bootID += String(bootResetCounter);
  bootID += "-";
  bootID += String(ESP.getCycleCount(), HEX);
  renderer.Setup(runtimeCtx);
  deviceSettingsRecordAvailable = loadDeviceSettings();
  loadDeviceAuthToken();
  bool hasSavedWifi = readWifiCredentials(savedWifiCredentials);
  bool wifiConnected = false;
  if (codexbar_display::esp8266::device_settings::ShouldImportLegacySdkWifi(
          deviceSettings.connectionMode, hasSavedWifi)) {
    wifiConnected = connectToSdkWifiConfig();
    if (wifiConnected) {
      hasSavedWifi = readWifiCredentials(savedWifiCredentials);
    }
  }
  savedWifiCredentialsAvailable = hasSavedWifi;
  const bool hasLegacyState =
      deviceSettingsRecordAvailable || hasSavedWifi || wifiConnected ||
      deviceAuthConfigured();
  (void)resolveInitialConnectionMode(hasLegacyState);
  (void)loadConnectionTransition();
  Serial.printf(
      "connection_mode_loaded mode=%s cable_supported=%d\n",
      codexbar_display::esp8266::device_settings::ConnectionModeName(
          deviceSettings.connectionMode),
      codexbar_display::esp8266::device_settings::SupportsCable(
          deviceSettings.connectionMode)
          ? 1
          : 0);
  restoreResetTrustAfterRestart();
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  loadActiveStoredThemeSpecCache();
#endif
  const unsigned long startupRenderStartUs = micros();
  renderer.DrawStatus(runtimeCtx, "VIBE TV", "Starting", "Please wait");
  recordRenderFull("status", micros() - startupRenderStartUs);
  if (deviceSettings.connectionMode ==
      codexbar_display::esp8266::device_settings::ConnectionMode::kCable) {
    codexbar_display::app::EmitDeviceHello(makeTransportConfig("usb"));
  }

#ifdef CODEXBAR_DISPLAY_PROBE_ONLY
  Serial.println("codexbar_display_ready_probe");
#else
  Serial.println("codexbar_display_ready_display");
#endif

  if (!codexbar_display::esp8266::device_settings::UsesWifi(
          deviceSettings.connectionMode)) {
    setupMode = false;
    WiFi.persistent(false);
    WiFi.setAutoReconnect(false);
    WiFi.disconnect(false);
    WiFi.mode(WIFI_OFF);
    const unsigned long renderStartUs = micros();
    renderer.DrawStatus(runtimeCtx, "VIBE TV", "Cable connected", "Open VibeTV App");
    recordRenderFull("cable_setup", micros() - renderStartUs);
    waitStatusRendered = true;
    Serial.println("connection_mode_ready mode=cable radio=off");
    return;
  }

  if (!wifiConnected && hasSavedWifi) {
    wifiConnected = connectToSavedWifi(savedWifiCredentials);
  }
  if (wifiConnected) {
    setupMode = false;
    // SNTP over UDP/123 in UTC. The local offset is applied by the device
    // clock, not by the C library, so no timezone database is linked in.
    // lwIP keeps the system clock corrected without any retry code here.
    configTime(0, 0, "pool.ntp.org");
    startHttpServer();
  } else if (connectionTransitionPending) {
    if (hasSavedWifi) {
      clearWifiCredentials();
      clearSdkWifiCredentials();
      savedWifiCredentialsAvailable = false;
    }
    connectionTransitionStartedAtMs = millis();
    Serial.printf(
        "connection_mode_transition_setup mode=wifi timeout_ms=%lu\n",
        device_settings::kConnectionTransitionSetupMs);
    startSetupAccessPoint();
  } else {
    startSetupAccessPoint();
  }
}

void loop() {
  const unsigned long loopStartUs = micros();
  bool rendered = false;
  unsigned long renderDurationUs = 0;

  if (pendingHttpRender) {
    const codexbar_display::core::SerialConsumeEvent event = pendingHttpRenderEvent;
    pendingHttpRender = false;
    renderAcceptedFrame(event);
  }

  handleSerialInput();

  if (httpServerStarted) {
    webServer.handleClient();
  }
  handleRawOtaClient();
  maintainConnectionTransition();
  maintainWifiConnection();
  if (!otaUploadInProgress && !assetUploadInProgress) {
    maintainDeviceClock();
  }
  if (!otaUploadInProgress) {
    maintainFirmwareUpdateNotice();
  }

  if (otaUploadInProgress || assetUploadInProgress) {
    delay(1);
    return;
  }

  maintainStandby();
  maintainScreensaverPreview();

  if (!waitStatusRendered &&
      codexbar_display::app::HasFrame(runtimeCtx) &&
      !codexbar_display::app::CurrentFrame(runtimeCtx).hasError &&
      !runtimeCtx.screenDirty &&
      !frameStaleStatusRendered) {
    renderer.TickActive(runtimeCtx);
    const int64_t remain = codexbar_display::app::CurrentRemainingSecs(runtimeCtx, millis());
    bool countdownMinuteChanged = false;
    if (remain != runtimeCtx.lastRenderedSecs) {
      if (codexbar_display::core::RemainingMinuteBucketChanged(
              remain, runtimeCtx.lastRenderedMinuteBucket)) {
        countdownMinuteChanged = true;
      } else {
        runtimeCtx.lastRenderedSecs = remain;
      }
    }
    for (size_t i = 0; i < codexbar_display::core::kMaxUsageWindows; ++i) {
      const int64_t slotRemain =
          codexbar_display::app::CurrentUsageWindowRemainingSecs(runtimeCtx, i, millis());
      if (slotRemain == runtimeCtx.lastRenderedUsageWindowSecs[i]) {
        continue;
      }
      if (codexbar_display::core::RemainingMinuteBucketChanged(
              slotRemain, runtimeCtx.lastRenderedUsageWindowMinuteBuckets[i])) {
        countdownMinuteChanged = true;
      } else {
        runtimeCtx.lastRenderedUsageWindowSecs[i] = slotRemain;
      }
    }
    // Provider slots count down locally too. A screensaver bound to them —
    // Night Clock does exactly that — would otherwise sit at the last received
    // value for as long as the Mac stays away.
    for (size_t i = 0; i < codexbar_display::core::kMaxProviderSlots; ++i) {
      const int64_t slotRemain =
          codexbar_display::app::CurrentProviderSlotRemainingSecs(runtimeCtx, i, millis());
      if (slotRemain == runtimeCtx.lastRenderedProviderSlotSecs[i]) {
        continue;
      }
      if (codexbar_display::core::RemainingMinuteBucketChanged(
              slotRemain, runtimeCtx.lastRenderedProviderSlotMinuteBuckets[i])) {
        countdownMinuteChanged = true;
      } else {
        runtimeCtx.lastRenderedProviderSlotSecs[i] = slotRemain;
      }
    }
    if (countdownMinuteChanged) {
#ifdef CODEXBAR_DISPLAY_PROBE_ONLY
      runtimeCtx.screenDirty = true;
#else
      const unsigned long renderStartUs = micros();
      renderer.DrawReset(runtimeCtx, remain);
      drawFirmwareUpdateNotice();
      recordRenderPartial("reset", micros() - renderStartUs);
#endif
    }
  }

  if (firmwareUpdateNoticeDirty &&
      !waitStatusRendered &&
      codexbar_display::app::HasFrame(runtimeCtx) &&
      !codexbar_display::app::CurrentFrame(runtimeCtx).hasError &&
      !runtimeCtx.screenDirty &&
      !frameStaleStatusRendered) {
    const unsigned long renderStartUs = micros();
    drawFirmwareUpdateNotice();
    rendered = true;
    renderDurationUs = micros() - renderStartUs;
    recordRenderPartial("update_notice", renderDurationUs);
  }

